//============================================
//
// エフェクトジェネレーター[effect_generator_base.cpp]
// Author:Uedakou
// 
//============================================
#include "effect_generator_base.h"	// エフェクトジェネレーター
//============================================
// コンスト
//============================================
CEffectGeneratorBase::CEffectGeneratorBase()
{
	m_nLife = -1;			// ライフ
	m_nCntLifeTime = 0;		// 経過時間
	SetNormalDraw(false);	// 通常描画をしない
	SetPoseDraw(false);		// ポーズ中描画しない

}
//============================================
// デストラ
//============================================
CEffectGeneratorBase::~CEffectGeneratorBase()
{
}
//============================================
// 初期化
//============================================
bool CEffectGeneratorBase::Init()
{
	return true;
}
//============================================
// 終了
//============================================
void CEffectGeneratorBase::Uninit()
{
}
//============================================
// 更新
//============================================
void CEffectGeneratorBase::Update()
{
	// 経過時間をカウント
	m_nCntLifeTime++;

	// 経過時間が寿命を越したら死亡フラグを立てる
	// （-1の場合のみ寿命無視）
	if (m_nLife != -1 &&
		m_nCntLifeTime >= m_nLife)
	{
		DeathFlag();
	}
}
//============================================
// 描画
//============================================
void CEffectGeneratorBase::Draw()
{
}